# Завдання 1
# C = float(input("Температура по Цельсію: "))
# print("Темература по Фаренгейту - ",(C*(9/5))+32)

# Завдання 2
# E= float(input("Сумма в євро - " ))
# KE= float(input("Курс євро - "))
# print("Значення в долларах",E*KE)

# Завдання 3
# a=int(input("Введіть число - "))
# print(a//10)
# print(a%10)

# Завдання 4
# a=input("Перше число - ")
# b=input("друге число - ")
# print(a+b)

# Завдання 5
# a=int(input("Введіть число - "))
# b=(a//100)
# c=(a%100)
# d=(c//10)
# f=(c%10)
# print(b)
# print(d)
# print(f)
# print(b+d+f)

# Завдання 6
# a=float(input("Сумма вкладу - "))
# b=int(input("Введіть відсоткову ставку,% - "))
# c=(b/100)
# d=a+(a*c)
# i=d+(d*c)
# f=i+(i*c)
# s=f+(f*c)
# w=s+(s*c)
# print("Сумма вкладу за перший рік",a)
# print("Сумма вкладу за другий рік",d)
# print("Сумма вкладу за третій рік",i)
# print("Сумма вкладу за четвертий рік",f)
# print("Сумма вкладу за п'ятий рік",s)
# print("Загальна сумма через 5 років",w)
# print("Чистий прибуток",w-a)
